#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dark-contoso/terraform-development/runs/run-tc1itnusoS6xsequ

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/myTFResourceGroup]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_bastion_host.bastion-vnet-2 will be created
  + resource "azurerm_bastion_host" "bastion-vnet-2" {
      + dns_name            = (known after apply)
      + id                  = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "bastion-vnet-sn-002"
      + resource_group_name = "rg-vnet-sn-002"
      + tags                = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }

      + ip_configuration {
          + name                 = "IpConf"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # azurerm_network_security_group.nsg-applicationsubnet-vnet-1 will be created
  + resource "azurerm_network_security_group" "nsg-applicationsubnet-vnet-1" {
      + id                  = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "nsg-applicationsubnet-vnet-sn-001"
      + resource_group_name = "rg-vnet-sn-001"
      + security_rule       = (known after apply)
      + tags                = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_network_security_group.nsg-bastionsubnet-vnet-1 will be created
  + resource "azurerm_network_security_group" "nsg-bastionsubnet-vnet-1" {
      + id                  = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "nsg-bastionsubnet-vnet-sn-001"
      + resource_group_name = "rg-vnet-sn-001"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "bastion-control-in-allow"
              + priority                                   = 120
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "GatewayManager"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = ""
              + source_port_ranges                         = [
                  + "443",
                  + "4443",
                ]
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "bastion-in-allow"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "Internet"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "AzureCloud"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "bastion-azure-out-allow"
              + priority                                   = 120
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = ""
              + destination_port_ranges                    = [
                  + "22",
                  + "3389",
                ]
              + direction                                  = "Outbound"
              + name                                       = "bastion-vnet-out-allow"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "bastion-in-deny"
              + priority                                   = 900
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_network_security_group.nsg-bastionsubnet-vnet-2 will be created
  + resource "azurerm_network_security_group" "nsg-bastionsubnet-vnet-2" {
      + id                  = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "nsg-bastionsubnet-vnet-sn-002"
      + resource_group_name = "rg-vnet-sn-002"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "bastion-control-in-allow"
              + priority                                   = 120
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "GatewayManager"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = ""
              + source_port_ranges                         = [
                  + "443",
                  + "4443",
                ]
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "bastion-in-allow"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "Internet"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "AzureCloud"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "bastion-azure-out-allow"
              + priority                                   = 120
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = ""
              + destination_port_ranges                    = [
                  + "22",
                  + "3389",
                ]
              + direction                                  = "Outbound"
              + name                                       = "bastion-vnet-out-allow"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Deny"
              + description                                = ""
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "bastion-in-deny"
              + priority                                   = 900
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_network_security_group.nsg-firewallmgmtsubnet-vnet-1 will be created
  + resource "azurerm_network_security_group" "nsg-firewallmgmtsubnet-vnet-1" {
      + id                  = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "nsg-firewallpublicsubnet-vnet-sn-001"
      + resource_group_name = "rg-vnet-sn-001"
      + security_rule       = (known after apply)
      + tags                = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_network_security_group.nsg-firewallpublicsubnet-vnet-1 will be created
  + resource "azurerm_network_security_group" "nsg-firewallpublicsubnet-vnet-1" {
      + id                  = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "nsg-firewallpublicsubnet-vnet-sn-001"
      + resource_group_name = "rg-vnet-sn-001"
      + security_rule       = (known after apply)
      + tags                = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_network_security_group.nsg-firewallsubnet-vnet-1 will be created
  + resource "azurerm_network_security_group" "nsg-firewallsubnet-vnet-1" {
      + id                  = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "nsg-firewallsubnet-vnet-sn-001"
      + resource_group_name = "rg-vnet-sn-001"
      + security_rule       = (known after apply)
      + tags                = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_network_security_group.nsg-gatewaysubnet-vnet-1 will be created
  + resource "azurerm_network_security_group" "nsg-gatewaysubnet-vnet-1" {
      + id                  = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "nsg-gatewaysubnet-vnet-sn-001"
      + resource_group_name = "rg-vnet-sn-001"
      + security_rule       = (known after apply)
      + tags                = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_network_security_group.nsg-gatewaysubnet-vnet-2 will be created
  + resource "azurerm_network_security_group" "nsg-gatewaysubnet-vnet-2" {
      + id                  = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "nsg-gatewaysubnet-vnet-sn-002"
      + resource_group_name = "rg-vnet-sn-002"
      + security_rule       = (known after apply)
      + tags                = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_network_security_group.nsg-managementsubnet-vnet-1 will be created
  + resource "azurerm_network_security_group" "nsg-managementsubnet-vnet-1" {
      + id                  = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "nsg-managementsubnet-vnet-sn-001"
      + resource_group_name = "rg-vnet-sn-001"
      + security_rule       = (known after apply)
      + tags                = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_network_security_group.nsg-serversubnet-vnet-2 will be created
  + resource "azurerm_network_security_group" "nsg-serversubnet-vnet-2" {
      + id                  = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "nsg-serversubnet-vnet-sn-002"
      + resource_group_name = "rg-vnet-sn-002"
      + security_rule       = (known after apply)
      + tags                = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_network_security_group.nsg-servicessubnet-vnet-1 will be created
  + resource "azurerm_network_security_group" "nsg-servicessubnet-vnet-1" {
      + id                  = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "nsg-servicessubnet-vnet-sn-001"
      + resource_group_name = "rg-vnet-sn-001"
      + security_rule       = (known after apply)
      + tags                = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_public_ip.bastion-pip-vnet-2 will be created
  + resource "azurerm_public_ip" "bastion-pip-vnet-2" {
      + allocation_method       = "Static"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "switzerlandnorth"
      + name                    = "pip-bastion-vnet-sn-002"
      + resource_group_name     = "rg-vnet-sn-002"
      + sku                     = "Standard"
      + tags                    = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_resource_group.rg-vnet-1 will be created
  + resource "azurerm_resource_group" "rg-vnet-1" {
      + id       = (known after apply)
      + location = "switzerlandnorth"
      + name     = "rg-vnet-sn-001"
      + tags     = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_resource_group.rg-vnet-2 will be created
  + resource "azurerm_resource_group" "rg-vnet-2" {
      + id       = (known after apply)
      + location = "switzerlandnorth"
      + name     = "rg-vnet-sn-002"
      + tags     = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_subnet.bastion-subnet-vnet-2 will be created
  + resource "azurerm_subnet" "bastion-subnet-vnet-2" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.11.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + resource_group_name                            = "rg-vnet-sn-002"
      + virtual_network_name                           = "vnet-sn-002"
    }

  # azurerm_virtual_network.vnet-1 will be created
  + resource "azurerm_virtual_network" "vnet-1" {
      + address_space       = [
          + "10.10.0.0/16",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "vnet-sn-001"
      + resource_group_name = "rg-vnet-sn-001"
      + subnet              = [
          + {
              + address_prefix = "10.10.1.0/24"
              + id             = (known after apply)
              + name           = "GatewaySubnet"
              + security_group = (known after apply)
            },
          + {
              + address_prefix = "10.10.2.0/24"
              + id             = (known after apply)
              + name           = "BastionSubnet"
              + security_group = (known after apply)
            },
          + {
              + address_prefix = "10.10.3.0/24"
              + id             = (known after apply)
              + name           = "FirewallSubnet"
              + security_group = (known after apply)
            },
          + {
              + address_prefix = "10.10.4.0/24"
              + id             = (known after apply)
              + name           = "FirewallPublicSubnet"
              + security_group = (known after apply)
            },
          + {
              + address_prefix = "10.10.5.0/24"
              + id             = (known after apply)
              + name           = "FirewallManagementSubnet"
              + security_group = (known after apply)
            },
          + {
              + address_prefix = "10.10.6.0/24"
              + id             = (known after apply)
              + name           = "ApplicationSubnet"
              + security_group = (known after apply)
            },
          + {
              + address_prefix = "10.10.7.0/24"
              + id             = (known after apply)
              + name           = "ManagementSubnet"
              + security_group = (known after apply)
            },
          + {
              + address_prefix = "10.10.8.0/24"
              + id             = (known after apply)
              + name           = "ServicesSubnet"
              + security_group = (known after apply)
            },
        ]
      + tags                = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_virtual_network.vnet-2 will be created
  + resource "azurerm_virtual_network" "vnet-2" {
      + address_space       = [
          + "10.11.0.0/16",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "switzerlandnorth"
      + name                = "vnet-sn-002"
      + resource_group_name = "rg-vnet-sn-002"
      + subnet              = [
          + {
              + address_prefix = "10.11.1.0/24"
              + id             = (known after apply)
              + name           = "GatewaySubnet"
              + security_group = (known after apply)
            },
          + {
              + address_prefix = "10.11.3.0/24"
              + id             = (known after apply)
              + name           = "Serversubnet"
              + security_group = (known after apply)
            },
        ]
      + tags                = {
          + "CreatedBy"   = "lrottach@darkcontoso.io"
          + "CreatedOn"   = "03/11/2020"
          + "Environment" = "Production"
        }
    }

  # azurerm_virtual_network_peering.peering-1-to-2 will be created
  + resource "azurerm_virtual_network_peering" "peering-1-to-2" {
      + allow_forwarded_traffic      = (known after apply)
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peering_vnet-1_vnet-2"
      + remote_virtual_network_id    = "vnet-sn-002"
      + resource_group_name          = "rg-vnet-sn-001"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "vnet-sn-001"
    }

  # azurerm_virtual_network_peering.peering-2-to-1 will be created
  + resource "azurerm_virtual_network_peering" "peering-2-to-1" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peering_vnet-2_vnet-1"
      + remote_virtual_network_id    = "vnet-sn-001"
      + resource_group_name          = "rg-vnet-sn-002"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "vnet-sn-002"
    }

Plan: 20 to add, 0 to change, 0 to destroy.
```
</details>
*Pusher: @lrottach, Action: `pull_request`*